Fix: README.MD
Alteração nos arquivos README e ARQUITETURA DO SISTEMA E FLOW DO USUARIO, para adicionar mermeid workflows e melhorar a estrutura do projeto.
